from xml.etree.ElementTree import tostring

import pyautogui
import time
import os
import ai

from pynput.keyboard import Controller


def find_and_click_image(image_path, wait_time=3):
    """
    查找屏幕上的图片并点击。

    :param image_path: 图片文件的路径
    :param wait_time: 等待时间，单位为秒
    :return: 如果点击成功返回True，否则返回False
    """

    try:
        # 查找屏幕上的图片位置
        location = pyautogui.locateCenterOnScreen(image_path)
        if location is not None:
            # 点击图片中心位置
            pyautogui.click(location)
            print("点击成功！")
            return True
        else:
            print("未找到图片。")
            return False
    except Exception as e:
        print(f"发生错误: {e}")
        return False


names = [
    "魏勋", "魏勋新", "秦覃", "秦沁心", "秦沁", "方羽",
    "王德", "张鹏", "杨冰", "夏铭", "谢芳", "张珍", "龙文华", "熊方文", "杨丽", "李文清",
    "杨晓红", "张洁", "王敏", "聂丽", "黄鹂", "张志强", "谢兴琼", "尹小林", "曾俊", "郑国美",
    "张若宇", "郑丽丽", "钱华强", "林婉儿", "张冬艳", "林晓霞", "张晓东", "金佳美", "金雅芳", "徐世恒",
    "张建霞", "周一韦", "杨小洁", "陈在周", "王海霞", "王颖", "朱哲礼", "陈文清", "陈柯宇", "宋琴",
    "张家佳", "曹雄", "熊安徽", "曹家文", "王文", "胡怡", "霍曼迪", "杨慧芳", "宋磊", "曾海媚",
    "张丽君", "孙文秀", "张凌云", "赵明轩", "易明元", "王浩洋", "曾军", "王丽芳", "孙渡云", "唐然",
    "宋静", "赖锐", "宋文", "祝融峰", "朱丹", "周立伟", "张鹏鹏", "魏光", "张志强", "余味",
    "黄玉婷", "黄德名", "周韵", "周原鹏", "李永安", "黄永芳", "黄勇", "王奕涵", "黄清钦", "孙瑞婷",
    "熊蔚薇", "翁家佳", "王萌萌", "彭丽桦", "王海洋", "潘小红", "潘望月", "赵巧云", "赵宇", "王思雨",
    "赵杨芸", "杨云芸", "付洋", "严云山", "王悦悦", "李云平", "唐雪晴", "唐晓玲", "黄鹏飞", "黄晓丹",
    "黄云清", "吴云青", "洪晓芸", "龚学爱", "付琴", "邓先杰", "先丽丽", "蒋欣怡", "周兰花", "曲靖",
    "苏静", "江陵", "柯旭", "叶雪", "陈蕾", "陈磊", "程韵竹", "龚爱迪", "王泽伟", "王烨位",
    "张爽", "张梦云", "张萌云", "刘艳林", "但俊彦", "张欧迪", "蔡杰克", "王明兰", "王彦霖", "张万霖",
    "张鹏鹏", "张继伟", "郑彪", "张菊花", "郭小刚", "曾佳明", "曾泽海", "易新伦", "曾鹏飞", "赵乾龙",
    "罗薇", "闫永峰", "刘亚萍", "刘淑华", "张翠花", "刘辉", "吴丽君", "蒋诗怡", "张丽君", "杨丽娟",
    "刘杰", "刘莉莉", "盛淑珍", "盛威韦", "吴云兰", "徐州梅", "许金川", "万小梅", "万梦冰", "段云海",
    "段淑华", "姜蒯", "耿怀岭", "耿怀", "张怀杰", "胡越", "胡万城", "唐川都", "罗冬梅", "何畅",
    "彭红元", "彭亚婷", "张光跃", "杨艳", "马志发", "文镜铮", "罗棵", "黄立菡", "罗颖", "蔚晓媛",
    "任欢", "姜绚", "李蓉", "林霞", "李茂杰", "吴丹妮", "李佳妮", "袁振兴", "袁震", "于莹",
    "吴新凤", "王婉儿", "李云涛", "李枫", "盛悦", "王素兰", "吴建军", "徐建军", "王淑凤", "李淑华",
    "袁明智", "袁群芳", "徐州兰", "余梅", "肖梦涵", "余莺儿", "周小燕", "周晓东", "胡婷", "殷秀梅",
    "孙秀丽", "孙春燕", "孙有辉", "王宇翔", "王宇翔", "钱伟明", "郑淑华", "张曼如", "李海清", "梁嘉怡",
    "周楠", "王志鹏", "朱颜雪", "赵阳", "曾佳", "刘思雨", "程磊鑫", "徐璐", "顾华美", "康华兰",
    "康城", "常远", "康乐乐", "王振华", "常轩逸", "胡海云", "蒋欣颀", "秦海珍", "钱淑华", "胡芸汐",
    "陈伟杰", "程度", "赵祯", "康兆儿", "程小云", "程序安", "程韵涵", "王颖慧", "张彩华", "章玉林",
    "章子懿", "李云海", "孙海梅", "孙秀秀", "赵兆丰", "李云爱", "周舒畅", "吴震宇", "郑爽未", "郑振海",
    "冯晓燕", "楚雄安", "唐尺秀", "杨茂", "雷鸣明", "梁晓晴", "张世荣", "杨浩然", "李世荣", "何丽娟",
    "刘佩语", "张国志", "冯传丽", "王琴", "夏秋鸿", "敖梓莹", "吴双", "杜开贤", "刘树荣", "罗婷",
    "葛城", "林月慧", "郑立文", "卢安慧", "邓霞", "伍万琼", "柴郡", "赵丽", "向文学", "范家伟",
    "王彬陶", "张朝廷", "潘敏", "傅宗豪", "廖羽南", "王忠义", "周建勇", "赵宇航", "孙凝雪", "汪峰峻",
    "何梅", "王磊", "何传银", "黄海", "朱韩雪", "宋瑞", "杨孟源", "邓军", "曾成娇", "吴振宇",
    "张成群", "胡光辉", "宋佳", "贾丹", "陈雨", "沈兴文", "赵永泉", "邹明", "邹平", "张权",
    "盛夏阳", "王淑兰", "邹燕京", "王爱宁", "乔雪", "乔恩琴", "乔林峰", "王云峰", "梁云凤", "尹媛",
    "王若兰", "张佳敏", "赵蓝心", "钱兰卓", "李晓燕", "周末敏", "吴敏闵", "郑佳慧", "王毅", "冯晓东",
    "程一鸣", "蒋玉凤", "魏才翔", "楚欣", "盛佳敏", "沈阳光", "高尚志", "韩雪鑫", "杨昊霖", "熊本春",
    "罗雄", "李茂", "赵兆", "李伟", "苟德林", "胥鸿", "杨清", "马明易", "谭紫宣", "刘丹丹",
    "张天", "张月", "谢利", "李维", "周天", "谢雨", "谢楠", "郭振宇", "张素芬", "程贤",
    "程素贤", "李先正", "钱孙李", "孙正义", "孙立飞", "刘洁", "孟雪琴", "蓝蝶依", "邓霞", "赵千寻",
    "杜青云", "罗安红", "王怀联", "罗惺", "李目含", "王超", "王德", "张鹏", "杨冰", "夏铭",
    "谢芳", "张珍", "龙文华", "熊方文", "杨丽", "李文清", "杨晓红", "张洁", "王敏", "聂丽",
    "黄鹂", "张志强", "谢兴琼", "尹小林", "曾俊", "张丽君", "张凌云", "赵明轩", "易明元", "王浩洋",
    "曾军", "王丽芳", "孙渡云", "唐然", "宋静", "赖锐", "宋文", "祝融峰", "朱丹", "周立伟",
    "张鹏鹏", "魏光", "张志强", "余味", "黄玉婷", "黄德名", "周韵", "周原鹏", "李永安", "黄勇",
    "王奕涵", "黄清钦2", "孙瑞婷", "熊蔚薇", "柯旭", "叶雪", "陈蕾", "陈磊", "程韵竹", "龚爱迪",
    "王泽伟", "王烨位", "张爽", "张梦云", "张萌云", "刘艳林", "但俊彦", "张欧迪", "蔡杰克", "王明兰",
    "王彦霖", "张万霖", "张鹏鹏", "张继伟", "郑彪", "张菊花", "郭小刚", "曾佳明", "曾泽海", "易新伦",
    "曾鹏飞", "赵乾龙", "罗薇", "闫永峰", "刘亚萍", "唐川都", "罗冬梅", "何畅", "彭红元", "彭亚婷",
    "张光跃", "杨艳", "马志发", "文镜铮", "罗棵", "黄立菡", "罗颖", "蔚晓媛", "任欢", "姜绚",
    "李蓉", "林霞", "李茂杰", "吴丹妮", "李佳妮", "袁振兴", "袁震", "于莹", "吴新凤", "王婉儿",
    "李云涛", "李枫", "盛悦", "王素兰", "吴建军", "徐建军", "王淑凤", "李淑华", "袁明智", "袁群芳",
    "徐州兰", "余梅", "肖梦涵", "余莺儿", "周小燕", "周晓东", "胡婷", "殷秀梅", "孙秀丽", "孙春燕",
    "孙有辉", "王宇翔", "王宇翔", "钱伟明", "郑淑华", "张曼如", "李海清", "梁嘉怡", "周楠", "王志鹏",
    "朱颜雪", "赵阳", "曾佳", "刘思雨", "程磊鑫", "任方云", "陈善贵", "胡聪", "杨全嫣", "唐开碧",
    "周蓉", "徐智", "袁芳", "李玲芳", "王德", "王德", "李兵", "舒益民", "李畅德", "杨悦超",
    "杨越超", "赵凯男", "田甜", "熊婧", "张星池", "秦新建", "王思其", "杨晓红", "陈璐", "王德",
    "罗菊", "沈东风", "金雅芳", "向德源", "魏勋", "秦覃", "张鹏", "龙文华", "霍曼迪", "沈阳光",
    "韩雪鑫", "熊本春", "黄海", "陈雨", "邹燕京", "梁云凤", "尹媛", "王若兰", "姜绚", "李蓉",
    "蔚晓媛", "文镜铮", "彭亚婷", "胡越", "万小梅", "刘杰", "张丽君", "刘辉", "张翠花", "闫永峰",
    "易新伦", "曾泽海", "曾佳明", "郭小刚", "张菊花", "郑彪", "张继伟", "张鹏鹏", "张万霖", "王彦霖",
    "王明兰", "蔡杰克", "张欧迪", "但俊彦", "张萌云", "张梦云", "张爽", "王烨位", "龚爱迪", "程韵竹",
    "陈磊", "陈蕾", "叶雪", "柯旭", "江陵", "苏静", "曲靖", "周兰花", "蒋欣怡", "先丽丽",
    "邓先杰", "付琴", "龚学爱", "洪晓芸", "吴云青", "黄云清", "黄晓丹", "黄鹏飞", "唐晓玲", "李云平",
    "王悦悦", "严云山", "付洋", "杨云芸", "赵杨芸", "王思雨", "赵巧云", "潘望月", "王海洋", "王萌萌",
    "翁家佳", "熊蔚薇", "孙瑞婷", "黄清钦", "王奕涵", "黄勇", "黄永芳", "李永安", "周原鹏", "周韵",
    "黄德名", "余味", "张志强", "魏光", "张鹏鹏", "张鹏鹏", "王运中", "王英", "胡思洪", "吴润泽",
    "田荣华", "鲁卫蓉", "陈果", "张成群", "王爱宁", "乔林峰", "李晓燕", "程素贤", "钱孙李", "孙立飞",
    "李目含", "王德", "尹小林", "聂丽", "王敏", "张洁", "杨晓红", "李文清", "张曼如", "刘丹丹",
    "谭紫宣", "谢雨", "张天", "马明易", "罗安红", "盛悦", "李云涛", "王婉儿", "袁明智", "吴丹妮",
    "李茂杰", "林霞", "李佳妮", "黄立菡", "徐州兰", "宋文", "赖锐", "宋静", "唐然", "孙渡云",
    "王丽芳", "王浩洋", "孙文秀", "曾海媚", "黄玉婷", "王思其", "张星池", "熊婧", "赵凯男", "杨越超",
    "李畅德", "陈善贵", "何德先", "方云清", "王美", "刘云", "王红", "刘伟", "余福达", "潘为举",
    "朱毓富", "李长庆", "崔绪怀", "肖桂芳", "李熔", "颜保清", "蒲先福", "陈庆联", "李光珍", "李旭坤",
    "罗庆莲", "向真媛", "黄欣乐", "何一轩", "李从南", "梁宗昔", "王幸福", "张孝勇", "李华", "刘素清",
    "王莹", "廖润", "杨显珍", "魏昌", "向德彬", "杨红", "魏勋新", "秦沁", "方羽", "杨冰",
    "夏铭", "谢芳", "张珍", "熊方文", "黄鹂", "谢兴琼", "曾俊", "郑国美", "张若宇", "钱华强",
    "林婉儿", "张冬艳", "林晓霞", "张晓东", "金佳美", "周一韦", "杨小洁", "陈在周", "王海霞", "王颖",
    "朱哲礼", "陈文清", "陈柯宇", "宋琴", "张家佳", "曹雄", "熊安徽", "曹家文", "王文", "胡怡",
    "杨慧芳"
]


def delay_txt():
    # 鼠标左键点击三下
    for _ in range(3):
        pyautogui.click()
        time.sleep(0.1)  # 每次点击之间的间隔

    # 按下删除键
    pyautogui.press('delete')


def wait_for_image(image_path, timeout=60):
    start_time = time.time()
    while True:
        try:
            # 查找图像
            location = pyautogui.locateOnScreen(image_path)
            if location is not None:
                return location
        except pyautogui.ImageNotFoundException:
            pass
        if time.time() - start_time > timeout:
            print("超时未找到图像")
            return None
        # 等待一段时间再重试
        print("等待页面加载...")
        time.sleep(1)


# 获取当前文件夹路径
current_dir = os.path.dirname(os.path.abspath(__file__))
# 构建图像的完整路径
image_path1 = os.path.join(current_dir, 'pic', '1.png')
image_path2 = os.path.join(current_dir, 'pic', '2.png')
image_path3 = os.path.join(current_dir, 'pic', '3.png')
image_path4 = os.path.join(current_dir, 'pic', '4.png')
keyboard = Controller()


def read_names(file_path):
    with open(file_path, 'r', encoding='utf-8') as file:
        names = file.readlines()
    return [name.strip() for name in names]


def remove_name(file_path, name_to_remove):
    with open(file_path, 'r', encoding='utf-8') as file:
        lines = file.readlines()
    with open(file_path, 'w', encoding='utf-8') as file:
        for line in lines:
            if line.strip() != name_to_remove:
                file.write(line)


def input_text(x, y, txt):
    pyautogui.click(x, y)
    delay_txt()
    keyboard.type(txt)
    time.sleep(0.5)


# for i in range(len(names)):
#     print("运行" + str(i) + "次")
#     print("等待页面加载")
#     wait_for_image(image_path1)
#     # 大病历
#     pyautogui.click(422, 329)
#     wait_for_image(image_path2)
#     time.sleep(1)
#     pyautogui.click(440, 396)
#     time.sleep(1)
#     pyautogui.click(1000, 552)
#     time.sleep(1)
#     pyautogui.click(1040, 294)
#     time.sleep(1)

#     # 姓名
#     input_text(451, 769, names[i])
#     pyautogui.click(759, 776)
#     print("生成病历中")
#     prompt = "姓名为" + \
#         names[i] + "生成一份随机病历, 诊断为皮疹，只包含主诉、现病史、既往史、个人史、家族史、体格检查、辅助检查、诊断，不要有性别、年龄、病历编号等其他信息"
#     result = ai.call_chatgpt_api(prompt)
#     print(result)
#     wait_for_image(image_path4)
#     input_text(448, 837, "皮疹")
#     input_text(656, 967, result)

#     pyautogui.click(580, 1388)
#     print("提交")
#     wait_for_image(image_path3)
#     pyautogui.click(813, 188)


def main():
    current_dir = os.path.dirname(os.path.abspath(__file__))
    image_paths = [os.path.join(
        current_dir, 'pic', f'{i}.png') for i in range(1, 5)]
    # keyboard = Controller()

    names_file = os.path.join(current_dir, 'names.txt')
    names = read_names(names_file)

    for i, name in enumerate(names):
        print(f"运行第 {i + 1} 次")
        wait_for_image(image_paths[0])

        # 模拟点击
        print("点击大病历")
        pyautogui.click(422, 329)
        wait_for_image(image_paths[1])
        print("点击疾病")
        pyautogui.click(440, 396)
        time.sleep(1)
        print("选择皮疹")
        pyautogui.click(1000, 552)
        pyautogui.click(1040, 294)

        # 输入姓名并生成病历
        input_text(451, 769, name)
        pyautogui.click(759, 776)
        print("生成病历中, 姓名为", name)
        prompt = f"姓名为{name}生成一份随机病历, 诊断为皮疹，只包含主诉、现病史、既往史、个人史、家族史、体格检查、辅助检查、诊断，不要有性别、年龄、病历编号等其他信息"
        result = ai.call_chatgpt_api(prompt)
        print(result)

        wait_for_image(image_paths[3])
        input_text(448, 837, "皮疹")
        input_text(656, 967, result)

        pyautogui.click(580, 1388)
        print("提交")
        wait_for_image(image_paths[2])
        pyautogui.click(813, 188)

        # 删除已处理的名字
        print("删除已处理的名字")
        remove_name(names_file, name)


if __name__ == "__main__":
    main()
